Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_gpdma.
; ================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_gpdma equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// GPDMA address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    MISR;
    volatile    uint32_t    SMISR;
    volatile    uint32_t    RESERVED1[15];
    volatile    uint32_t    C0LBAR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    C0FCR;
    volatile    uint32_t    C0SR;
    volatile    uint32_t    C0CR;
    volatile    uint32_t    RESERVED3[10];
    volatile    uint32_t    C0TR1;
    volatile    uint32_t    C0TR2;
    volatile    uint32_t    C0BR1;
    volatile    uint32_t    C0SAR;
    volatile    uint32_t    C0DAR;
    volatile    uint32_t    RESERVED4[10];
    volatile    uint32_t    C0LLR;
    volatile    uint32_t    C1LBAR;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    C1FCR;
    volatile    uint32_t    C1SR;
    volatile    uint32_t    C1CR;
    volatile    uint32_t    RESERVED6[10];
    volatile    uint32_t    C1TR1;
    volatile    uint32_t    C1TR2;
    volatile    uint32_t    C1BR1;
    volatile    uint32_t    C1SAR;
    volatile    uint32_t    C1DAR;
    volatile    uint32_t    RESERVED7[10];
    volatile    uint32_t    C1LLR;
    volatile    uint32_t    C2LBAR;
    volatile    uint32_t    RESERVED8[2];
    volatile    uint32_t    C2FCR;
    volatile    uint32_t    C2SR;
    volatile    uint32_t    C2CR;
    volatile    uint32_t    RESERVED9[10];
    volatile    uint32_t    C2TR1;
    volatile    uint32_t    C2TR2;
    volatile    uint32_t    C2BR1;
    volatile    uint32_t    C2SAR;
    volatile    uint32_t    C2DAR;
    volatile    uint32_t    RESERVED10[10];
    volatile    uint32_t    C2LLR;
    volatile    uint32_t    C3LBAR;
    volatile    uint32_t    RESERVED11[2];
    volatile    uint32_t    C3FCR;
    volatile    uint32_t    C3SR;
    volatile    uint32_t    C3CR;
    volatile    uint32_t    RESERVED12[10];
    volatile    uint32_t    C3TR1;
    volatile    uint32_t    C3TR2;
    volatile    uint32_t    C3BR1;
    volatile    uint32_t    C3SAR;
    volatile    uint32_t    C3DAR;
    volatile    uint32_t    RESERVED13[10];
    volatile    uint32_t    C3LLR;
    volatile    uint32_t    C4LBAR;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    C4FCR;
    volatile    uint32_t    C4SR;
    volatile    uint32_t    C4CR;
    volatile    uint32_t    RESERVED15[11];
    volatile    uint32_t    C4TR2;
    volatile    uint32_t    C4BR1;
    volatile    uint32_t    C4SAR;
    volatile    uint32_t    C4DAR;
    volatile    uint32_t    RESERVED16[10];
    volatile    uint32_t    C4LLR;
    volatile    uint32_t    C5LBAR;
    volatile    uint32_t    RESERVED17[2];
    volatile    uint32_t    C5FCR;
    volatile    uint32_t    C5SR;
    volatile    uint32_t    C5CR;
    volatile    uint32_t    RESERVED18[11];
    volatile    uint32_t    C5TR2;
    volatile    uint32_t    C5BR1;
    volatile    uint32_t    C5SAR;
    volatile    uint32_t    C5DAR;
    volatile    uint32_t    RESERVED19[10];
    volatile    uint32_t    C5LLR;
    volatile    uint32_t    C6LBAR;
    volatile    uint32_t    RESERVED20[2];
    volatile    uint32_t    C6FCR;
    volatile    uint32_t    C6SR;
    volatile    uint32_t    C6CR;
    volatile    uint32_t    RESERVED21[11];
    volatile    uint32_t    C6TR2;
    volatile    uint32_t    C6BR1;
    volatile    uint32_t    C6SAR;
    volatile    uint32_t    C6DAR;
    volatile    uint32_t    RESERVED22[10];
    volatile    uint32_t    C6LLR;
    volatile    uint32_t    C7LBAR;
    volatile    uint32_t    RESERVED23[2];
    volatile    uint32_t    C7FCR;
    volatile    uint32_t    C7SR;
    volatile    uint32_t    C7CR;
    volatile    uint32_t    RESERVED24[11];
    volatile    uint32_t    C7TR2;
    volatile    uint32_t    C7BR1;
    volatile    uint32_t    C7SAR;
    volatile    uint32_t    C7DAR;
    volatile    uint32_t    RESERVED25[10];
    volatile    uint32_t    C7LLR;
    volatile    uint32_t    C8LBAR;
    volatile    uint32_t    RESERVED26[2];
    volatile    uint32_t    C8FCR;
    volatile    uint32_t    C8SR;
    volatile    uint32_t    C8CR;
    volatile    uint32_t    RESERVED27[11];
    volatile    uint32_t    C8TR2;
    volatile    uint32_t    C8BR1;
    volatile    uint32_t    C8SAR;
    volatile    uint32_t    C8DAR;
    volatile    uint32_t    RESERVED28[10];
    volatile    uint32_t    C8LLR;
    volatile    uint32_t    C9LBAR;
    volatile    uint32_t    RESERVED29[2];
    volatile    uint32_t    C9FCR;
    volatile    uint32_t    C9SR;
    volatile    uint32_t    C9CR;
    volatile    uint32_t    RESERVED30[11];
    volatile    uint32_t    C9TR2;
    volatile    uint32_t    C9BR1;
    volatile    uint32_t    C9SAR;
    volatile    uint32_t    C9DAR;
    volatile    uint32_t    RESERVED31[10];
    volatile    uint32_t    C9LLR;
    volatile    uint32_t    C10LBAR;
    volatile    uint32_t    RESERVED32[2];
    volatile    uint32_t    C10FCR;
    volatile    uint32_t    C10SR;
    volatile    uint32_t    C10CR;
    volatile    uint32_t    RESERVED33[11];
    volatile    uint32_t    C10TR2;
    volatile    uint32_t    C10BR1;
    volatile    uint32_t    C10SAR;
    volatile    uint32_t    C10DAR;
    volatile    uint32_t    RESERVED34[10];
    volatile    uint32_t    C10LLR;
    volatile    uint32_t    C11LBAR;
    volatile    uint32_t    RESERVED35[2];
    volatile    uint32_t    C11FCR;
    volatile    uint32_t    C11SR;
    volatile    uint32_t    C11CR;
    volatile    uint32_t    RESERVED36[11];
    volatile    uint32_t    C11TR2;
    volatile    uint32_t    C11BR1;
    volatile    uint32_t    C11SAR;
    volatile    uint32_t    C11DAR;
    volatile    uint32_t    RESERVED37[10];
    volatile    uint32_t    C11LLR;
    volatile    uint32_t    C12LBAR;
    volatile    uint32_t    RESERVED38[2];
    volatile    uint32_t    C12FCR;
    volatile    uint32_t    C12SR;
    volatile    uint32_t    C12CR;
    volatile    uint32_t    RESERVED39[11];
    volatile    uint32_t    C12TR2;
    volatile    uint32_t    C12BR1;
    volatile    uint32_t    C12SAR;
    volatile    uint32_t    C12DAR;
    volatile    uint32_t    C12TR3;
    volatile    uint32_t    C12BR2;
    volatile    uint32_t    RESERVED40[8];
    volatile    uint32_t    C12LLR;
    volatile    uint32_t    C13LBAR;
    volatile    uint32_t    RESERVED41[2];
    volatile    uint32_t    C13FCR;
    volatile    uint32_t    C13SR;
    volatile    uint32_t    C13CR;
    volatile    uint32_t    RESERVED42[11];
    volatile    uint32_t    C13TR2;
    volatile    uint32_t    C13BR1;
    volatile    uint32_t    C13SAR;
    volatile    uint32_t    C13DAR;
    volatile    uint32_t    C13TR3;
    volatile    uint32_t    C13BR2;
    volatile    uint32_t    RESERVED43[8];
    volatile    uint32_t    C13LLR;
    volatile    uint32_t    C14LBAR;
    volatile    uint32_t    RESERVED44[2];
    volatile    uint32_t    C14FCR;
    volatile    uint32_t    C14SR;
    volatile    uint32_t    C14CR;
    volatile    uint32_t    RESERVED45[11];
    volatile    uint32_t    C14TR2;
    volatile    uint32_t    C14BR1;
    volatile    uint32_t    C14SAR;
    volatile    uint32_t    C14DAR;
    volatile    uint32_t    C14TR3;
    volatile    uint32_t    C14BR2;
    volatile    uint32_t    RESERVED46[8];
    volatile    uint32_t    C14LLR;
    volatile    uint32_t    C15LBAR;
    volatile    uint32_t    RESERVED47[2];
    volatile    uint32_t    C15FCR;
    volatile    uint32_t    C15SR;
    volatile    uint32_t    C15CR;
    volatile    uint32_t    RESERVED48[11];
    volatile    uint32_t    C15TR2;
    volatile    uint32_t    C15BR1;
    volatile    uint32_t    C15SAR;
    volatile    uint32_t    C15DAR;
    volatile    uint32_t    C15TR3;
    volatile    uint32_t    C15BR2;
    volatile    uint32_t    RESERVED49[8];
    volatile    uint32_t    C15LLR;
} GPDMA_TypeDef;

#ifdef __cplusplus
#define GPDMA1_NS   reinterpret_cast<GPDMA_TypeDef *>(0x40020000U)
#define GPDMA1_S    reinterpret_cast<GPDMA_TypeDef *>(0x50020000U)

#else
#define GPDMA1_NS   ((GPDMA_TypeDef *)0x40020000U)
#define GPDMA1_S    ((GPDMA_TypeDef *)0x50020000U)
#endif

