Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
// SECCFGR Configuration

#define GPDMA_SECCFGR_SEC15     (0x1U<<15)
#define GPDMA_SECCFGR_SEC14     (0x1U<<14)
#define GPDMA_SECCFGR_SEC13     (0x1U<<13)
#define GPDMA_SECCFGR_SEC12     (0x1U<<12)
#define GPDMA_SECCFGR_SEC11     (0x1U<<11)
#define GPDMA_SECCFGR_SEC10     (0x1U<<10)
#define GPDMA_SECCFGR_SEC9      (0x1U<<9)
#define GPDMA_SECCFGR_SEC8      (0x1U<<8)
#define GPDMA_SECCFGR_SEC7      (0x1U<<7)
#define GPDMA_SECCFGR_SEC6      (0x1U<<6)
#define GPDMA_SECCFGR_SEC5      (0x1U<<5)
#define GPDMA_SECCFGR_SEC4      (0x1U<<4)
#define GPDMA_SECCFGR_SEC3      (0x1U<<3)
#define GPDMA_SECCFGR_SEC2      (0x1U<<2)
#define GPDMA_SECCFGR_SEC1      (0x1U<<1)
#define GPDMA_SECCFGR_SEC0      (0x1U<<0)

// PRIVCFGR Configuration

#define GPDMA_PRIVCFGR_PRIV15   (0x1U<<15)
#define GPDMA_PRIVCFGR_PRIV14   (0x1U<<14)
#define GPDMA_PRIVCFGR_PRIV13   (0x1U<<13)
#define GPDMA_PRIVCFGR_PRIV12   (0x1U<<12)
#define GPDMA_PRIVCFGR_PRIV11   (0x1U<<11)
#define GPDMA_PRIVCFGR_PRIV10   (0x1U<<10)
#define GPDMA_PRIVCFGR_PRIV9    (0x1U<<9)
#define GPDMA_PRIVCFGR_PRIV8    (0x1U<<8)
#define GPDMA_PRIVCFGR_PRIV7    (0x1U<<7)
#define GPDMA_PRIVCFGR_PRIV6    (0x1U<<6)
#define GPDMA_PRIVCFGR_PRIV5    (0x1U<<5)
#define GPDMA_PRIVCFGR_PRIV4    (0x1U<<4)
#define GPDMA_PRIVCFGR_PRIV3    (0x1U<<3)
#define GPDMA_PRIVCFGR_PRIV2    (0x1U<<2)
#define GPDMA_PRIVCFGR_PRIV1    (0x1U<<1)
#define GPDMA_PRIVCFGR_PRIV0    (0x1U<<0)

// MISR Configuration

#define GPDMA_MISR_MIS15        (0x1U<<15)
#define GPDMA_MISR_MIS14        (0x1U<<14)
#define GPDMA_MISR_MIS13        (0x1U<<13)
#define GPDMA_MISR_MIS12        (0x1U<<12)
#define GPDMA_MISR_MIS11        (0x1U<<11)
#define GPDMA_MISR_MIS10        (0x1U<<10)
#define GPDMA_MISR_MIS9         (0x1U<<9)
#define GPDMA_MISR_MIS8         (0x1U<<8)
#define GPDMA_MISR_MIS7         (0x1U<<7)
#define GPDMA_MISR_MIS6         (0x1U<<6)
#define GPDMA_MISR_MIS5         (0x1U<<5)
#define GPDMA_MISR_MIS4         (0x1U<<4)
#define GPDMA_MISR_MIS3         (0x1U<<3)
#define GPDMA_MISR_MIS2         (0x1U<<2)
#define GPDMA_MISR_MIS1         (0x1U<<1)
#define GPDMA_MISR_MIS0         (0x1U<<0)

// SMISR Configuration

#define GPDMA_SMISR_MIS15       (0x1U<<15)
#define GPDMA_SMISR_MIS14       (0x1U<<14)
#define GPDMA_SMISR_MIS13       (0x1U<<13)
#define GPDMA_SMISR_MIS12       (0x1U<<12)
#define GPDMA_SMISR_MIS11       (0x1U<<11)
#define GPDMA_SMISR_MIS10       (0x1U<<10)
#define GPDMA_SMISR_MIS9        (0x1U<<9)
#define GPDMA_SMISR_MIS8        (0x1U<<8)
#define GPDMA_SMISR_MIS7        (0x1U<<7)
#define GPDMA_SMISR_MIS6        (0x1U<<6)
#define GPDMA_SMISR_MIS5        (0x1U<<5)
#define GPDMA_SMISR_MIS4        (0x1U<<4)
#define GPDMA_SMISR_MIS3        (0x1U<<3)
#define GPDMA_SMISR_MIS2        (0x1U<<2)
#define GPDMA_SMISR_MIS1        (0x1U<<1)
#define GPDMA_SMISR_MIS0        (0x1U<<0)

// C0LBAR Configuration

#define GPDMA_C0LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C0LBAR_LBA_0      (0x1U<<16)

// C0FCR Configuration

#define GPDMA_C0FCR_TOF         (0x1U<<14)
#define GPDMA_C0FCR_SUSPF       (0x1U<<13)
#define GPDMA_C0FCR_USEF        (0x1U<<12)
#define GPDMA_C0FCR_ULEF        (0x1U<<11)
#define GPDMA_C0FCR_DTEF        (0x1U<<10)
#define GPDMA_C0FCR_HTF         (0x1U<<9)
#define GPDMA_C0FCR_TCF         (0x1U<<8)

// C0SR Configuration

#define GPDMA_C0SR_FIFOL        (0xFFU<<16)
#define GPDMA_C0SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C0SR_SUSPF        (0x1U<<13)
#define GPDMA_C0SR_USEF         (0x1U<<12)
#define GPDMA_C0SR_ULEF         (0x1U<<11)
#define GPDMA_C0SR_DTEF         (0x1U<<10)
#define GPDMA_C0SR_HTF          (0x1U<<9)
#define GPDMA_C0SR_TCF          (0x1U<<8)
#define GPDMA_C0SR_IDLEF        (0x1U<<0)

// C0CR Configuration

#define GPDMA_C0CR_PRIO         (0x3U<<22)
#define GPDMA_C0CR_PRIO_0       (0x1U<<22)
#define GPDMA_C0CR_LAP          (0x1U<<17)
#define GPDMA_C0CR_LSM          (0x1U<<16)
#define GPDMA_C0CR_SUSPIE       (0x1U<<13)
#define GPDMA_C0CR_USEIE        (0x1U<<12)
#define GPDMA_C0CR_ULEIE        (0x1U<<11)
#define GPDMA_C0CR_DTEIE        (0x1U<<10)
#define GPDMA_C0CR_HTIE         (0x1U<<9)
#define GPDMA_C0CR_TCIE         (0x1U<<8)
#define GPDMA_C0CR_SUSP         (0x1U<<2)
#define GPDMA_C0CR_RESET        (0x1U<<1)
#define GPDMA_C0CR_EN           (0x1U<<0)

// C0TR1 Configuration

#define GPDMA_C0TR1_DSEC        (0x1U<<31)
#define GPDMA_C0TR1_DAP         (0x1U<<30)
#define GPDMA_C0TR1_DHX         (0x1U<<27)
#define GPDMA_C0TR1_DBX         (0x1U<<26)
#define GPDMA_C0TR1_DBL_1       (0x3FU<<20)
#define GPDMA_C0TR1_DBL_1_0     (0x1U<<20)
#define GPDMA_C0TR1_DINC        (0x1U<<19)
#define GPDMA_C0TR1_DDW_LOG2    (0x3U<<16)
#define GPDMA_C0TR1_DDW_LOG2_0  (0x1U<<16)
#define GPDMA_C0TR1_SSEC        (0x1U<<15)
#define GPDMA_C0TR1_SAP         (0x1U<<14)
#define GPDMA_C0TR1_SBX         (0x1U<<13)
#define GPDMA_C0TR1_PAM         (0x3U<<11)
#define GPDMA_C0TR1_PAM_0       (0x1U<<11)
#define GPDMA_C0TR1_SBL_1       (0x3FU<<4)
#define GPDMA_C0TR1_SBL_1_0     (0x1U<<4)
#define GPDMA_C0TR1_SINC        (0x1U<<3)
#define GPDMA_C0TR1_SDW_LOG2    (0x3U<<0)
#define GPDMA_C0TR1_SDW_LOG2_0  (0x1U<<0)

// C0TR2 Configuration

#define GPDMA_C0TR2_TCEM        (0x3U<<30)
#define GPDMA_C0TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C0TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C0TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C0TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C0TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C0TR2_TRIGM       (0x3U<<14)
#define GPDMA_C0TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C0TR2_BREQ        (0x1U<<11)
#define GPDMA_C0TR2_DREQ        (0x1U<<10)
#define GPDMA_C0TR2_SWREQ       (0x1U<<9)
#define GPDMA_C0TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C0TR2_REQSEL_0    (0x1U<<0)

// C0BR1 Configuration

#define GPDMA_C0BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C0BR1_BNDT_0      (0x1U<<0)

// C0SAR Configuration

#define GPDMA_C0SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C0SAR_SA_0        (0x1U<<0)

// C0DAR Configuration

#define GPDMA_C0DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C0DAR_DA_0        (0x1U<<0)

// C0LLR Configuration

#define GPDMA_C0LLR_UT1         (0x1U<<31)
#define GPDMA_C0LLR_UT2         (0x1U<<30)
#define GPDMA_C0LLR_UB1         (0x1U<<29)
#define GPDMA_C0LLR_USA         (0x1U<<28)
#define GPDMA_C0LLR_UDA         (0x1U<<27)
#define GPDMA_C0LLR_ULL         (0x1U<<16)
#define GPDMA_C0LLR_LA          (0x3FFFU<<2)
#define GPDMA_C0LLR_LA_0        (0x1U<<2)

