Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
// C1LBAR Configuration

#define GPDMA_C1LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C1LBAR_LBA_0      (0x1U<<16)

// C1FCR Configuration

#define GPDMA_C1FCR_TOF         (0x1U<<14)
#define GPDMA_C1FCR_SUSPF       (0x1U<<13)
#define GPDMA_C1FCR_USEF        (0x1U<<12)
#define GPDMA_C1FCR_ULEF        (0x1U<<11)
#define GPDMA_C1FCR_DTEF        (0x1U<<10)
#define GPDMA_C1FCR_HTF         (0x1U<<9)
#define GPDMA_C1FCR_TCF         (0x1U<<8)

// C1SR Configuration

#define GPDMA_C1SR_FIFOL        (0xFFU<<16)
#define GPDMA_C1SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C1SR_SUSPF        (0x1U<<13)
#define GPDMA_C1SR_USEF         (0x1U<<12)
#define GPDMA_C1SR_ULEF         (0x1U<<11)
#define GPDMA_C1SR_DTEF         (0x1U<<10)
#define GPDMA_C1SR_HTF          (0x1U<<9)
#define GPDMA_C1SR_TCF          (0x1U<<8)
#define GPDMA_C1SR_IDLEF        (0x1U<<0)

// C1CR Configuration

#define GPDMA_C1CR_PRIO         (0x3U<<22)
#define GPDMA_C1CR_PRIO_0       (0x1U<<22)
#define GPDMA_C1CR_LAP          (0x1U<<17)
#define GPDMA_C1CR_LSM          (0x1U<<16)
#define GPDMA_C1CR_SUSPIE       (0x1U<<13)
#define GPDMA_C1CR_USEIE        (0x1U<<12)
#define GPDMA_C1CR_ULEIE        (0x1U<<11)
#define GPDMA_C1CR_DTEIE        (0x1U<<10)
#define GPDMA_C1CR_HTIE         (0x1U<<9)
#define GPDMA_C1CR_TCIE         (0x1U<<8)
#define GPDMA_C1CR_SUSP         (0x1U<<2)
#define GPDMA_C1CR_RESET        (0x1U<<1)
#define GPDMA_C1CR_EN           (0x1U<<0)

// C1TR1 Configuration

#define GPDMA_C1TR1_DSEC        (0x1U<<31)
#define GPDMA_C1TR1_DAP         (0x1U<<30)
#define GPDMA_C1TR1_DHX         (0x1U<<27)
#define GPDMA_C1TR1_DBX         (0x1U<<26)
#define GPDMA_C1TR1_DBL_1       (0x3FU<<20)
#define GPDMA_C1TR1_DBL_1_0     (0x1U<<20)
#define GPDMA_C1TR1_DINC        (0x1U<<19)
#define GPDMA_C1TR1_DDW_LOG2    (0x3U<<16)
#define GPDMA_C1TR1_DDW_LOG2_0  (0x1U<<16)
#define GPDMA_C1TR1_SSEC        (0x1U<<15)
#define GPDMA_C1TR1_SAP         (0x1U<<14)
#define GPDMA_C1TR1_SBX         (0x1U<<13)
#define GPDMA_C1TR1_PAM         (0x3U<<11)
#define GPDMA_C1TR1_PAM_0       (0x1U<<11)
#define GPDMA_C1TR1_SBL_1       (0x3FU<<4)
#define GPDMA_C1TR1_SBL_1_0     (0x1U<<4)
#define GPDMA_C1TR1_SINC        (0x1U<<3)
#define GPDMA_C1TR1_SDW_LOG2    (0x3U<<0)
#define GPDMA_C1TR1_SDW_LOG2_0  (0x1U<<0)

// C1TR2 Configuration

#define GPDMA_C1TR2_TCEM        (0x3U<<30)
#define GPDMA_C1TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C1TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C1TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C1TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C1TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C1TR2_TRIGM       (0x3U<<14)
#define GPDMA_C1TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C1TR2_BREQ        (0x1U<<11)
#define GPDMA_C1TR2_DREQ        (0x1U<<10)
#define GPDMA_C1TR2_SWREQ       (0x1U<<9)
#define GPDMA_C1TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C1TR2_REQSEL_0    (0x1U<<0)

// C1BR1 Configuration

#define GPDMA_C1BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C1BR1_BNDT_0      (0x1U<<0)

// C1SAR Configuration

#define GPDMA_C1SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C1SAR_SA_0        (0x1U<<0)

// C1DAR Configuration

#define GPDMA_C1DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C1DAR_DA_0        (0x1U<<0)

// C1LLR Configuration

#define GPDMA_C1LLR_UT1         (0x1U<<31)
#define GPDMA_C1LLR_UT2         (0x1U<<30)
#define GPDMA_C1LLR_UB1         (0x1U<<29)
#define GPDMA_C1LLR_USA         (0x1U<<28)
#define GPDMA_C1LLR_UDA         (0x1U<<27)
#define GPDMA_C1LLR_ULL         (0x1U<<16)
#define GPDMA_C1LLR_LA          (0x3FFFU<<2)
#define GPDMA_C1LLR_LA_0        (0x1U<<2)

// C2LBAR Configuration

#define GPDMA_C2LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C2LBAR_LBA_0      (0x1U<<16)

// C2FCR Configuration

#define GPDMA_C2FCR_TOF         (0x1U<<14)
#define GPDMA_C2FCR_SUSPF       (0x1U<<13)
#define GPDMA_C2FCR_USEF        (0x1U<<12)
#define GPDMA_C2FCR_ULEF        (0x1U<<11)
#define GPDMA_C2FCR_DTEF        (0x1U<<10)
#define GPDMA_C2FCR_HTF         (0x1U<<9)
#define GPDMA_C2FCR_TCF         (0x1U<<8)

// C2SR Configuration

#define GPDMA_C2SR_FIFOL        (0xFFU<<16)
#define GPDMA_C2SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C2SR_SUSPF        (0x1U<<13)
#define GPDMA_C2SR_USEF         (0x1U<<12)
#define GPDMA_C2SR_ULEF         (0x1U<<11)
#define GPDMA_C2SR_DTEF         (0x1U<<10)
#define GPDMA_C2SR_HTF          (0x1U<<9)
#define GPDMA_C2SR_TCF          (0x1U<<8)
#define GPDMA_C2SR_IDLEF        (0x1U<<0)

// C2CR Configuration

#define GPDMA_C2CR_PRIO         (0x3U<<22)
#define GPDMA_C2CR_PRIO_0       (0x1U<<22)
#define GPDMA_C2CR_LAP          (0x1U<<17)
#define GPDMA_C2CR_LSM          (0x1U<<16)
#define GPDMA_C2CR_SUSPIE       (0x1U<<13)
#define GPDMA_C2CR_USEIE        (0x1U<<12)
#define GPDMA_C2CR_ULEIE        (0x1U<<11)
#define GPDMA_C2CR_DTEIE        (0x1U<<10)
#define GPDMA_C2CR_HTIE         (0x1U<<9)
#define GPDMA_C2CR_TCIE         (0x1U<<8)
#define GPDMA_C2CR_SUSP         (0x1U<<2)
#define GPDMA_C2CR_RESET        (0x1U<<1)
#define GPDMA_C2CR_EN           (0x1U<<0)

// C2TR1 Configuration

#define GPDMA_C2TR1_DSEC        (0x1U<<31)
#define GPDMA_C2TR1_DAP         (0x1U<<30)
#define GPDMA_C2TR1_DHX         (0x1U<<27)
#define GPDMA_C2TR1_DBX         (0x1U<<26)
#define GPDMA_C2TR1_DBL_1       (0x3FU<<20)
#define GPDMA_C2TR1_DBL_1_0     (0x1U<<20)
#define GPDMA_C2TR1_DINC        (0x1U<<19)
#define GPDMA_C2TR1_DDW_LOG2    (0x3U<<16)
#define GPDMA_C2TR1_DDW_LOG2_0  (0x1U<<16)
#define GPDMA_C2TR1_SSEC        (0x1U<<15)
#define GPDMA_C2TR1_SAP         (0x1U<<14)
#define GPDMA_C2TR1_SBX         (0x1U<<13)
#define GPDMA_C2TR1_PAM         (0x3U<<11)
#define GPDMA_C2TR1_PAM_0       (0x1U<<11)
#define GPDMA_C2TR1_SBL_1       (0x3FU<<4)
#define GPDMA_C2TR1_SBL_1_0     (0x1U<<4)
#define GPDMA_C2TR1_SINC        (0x1U<<3)
#define GPDMA_C2TR1_SDW_LOG2    (0x3U<<0)
#define GPDMA_C2TR1_SDW_LOG2_0  (0x1U<<0)

// C2TR2 Configuration

#define GPDMA_C2TR2_TCEM        (0x3U<<30)
#define GPDMA_C2TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C2TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C2TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C2TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C2TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C2TR2_TRIGM       (0x3U<<14)
#define GPDMA_C2TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C2TR2_BREQ        (0x1U<<11)
#define GPDMA_C2TR2_DREQ        (0x1U<<10)
#define GPDMA_C2TR2_SWREQ       (0x1U<<9)
#define GPDMA_C2TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C2TR2_REQSEL_0    (0x1U<<0)

// C2BR1 Configuration

#define GPDMA_C2BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C2BR1_BNDT_0      (0x1U<<0)

// C2SAR Configuration

#define GPDMA_C2SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C2SAR_SA_0        (0x1U<<0)

// C2DAR Configuration

#define GPDMA_C2DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C2DAR_DA_0        (0x1U<<0)

