Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
// C2LLR Configuration

#define GPDMA_C2LLR_UT1         (0x1U<<31)
#define GPDMA_C2LLR_UT2         (0x1U<<30)
#define GPDMA_C2LLR_UB1         (0x1U<<29)
#define GPDMA_C2LLR_USA         (0x1U<<28)
#define GPDMA_C2LLR_UDA         (0x1U<<27)
#define GPDMA_C2LLR_ULL         (0x1U<<16)
#define GPDMA_C2LLR_LA          (0x3FFFU<<2)
#define GPDMA_C2LLR_LA_0        (0x1U<<2)

// C3LBAR Configuration

#define GPDMA_C3LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C3LBAR_LBA_0      (0x1U<<16)

// C3FCR Configuration

#define GPDMA_C3FCR_TOF         (0x1U<<14)
#define GPDMA_C3FCR_SUSPF       (0x1U<<13)
#define GPDMA_C3FCR_USEF        (0x1U<<12)
#define GPDMA_C3FCR_ULEF        (0x1U<<11)
#define GPDMA_C3FCR_DTEF        (0x1U<<10)
#define GPDMA_C3FCR_HTF         (0x1U<<9)
#define GPDMA_C3FCR_TCF         (0x1U<<8)

// C3SR Configuration

#define GPDMA_C3SR_FIFOL        (0xFFU<<16)
#define GPDMA_C3SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C3SR_SUSPF        (0x1U<<13)
#define GPDMA_C3SR_USEF         (0x1U<<12)
#define GPDMA_C3SR_ULEF         (0x1U<<11)
#define GPDMA_C3SR_DTEF         (0x1U<<10)
#define GPDMA_C3SR_HTF          (0x1U<<9)
#define GPDMA_C3SR_TCF          (0x1U<<8)
#define GPDMA_C3SR_IDLEF        (0x1U<<0)

// C3CR Configuration

#define GPDMA_C3CR_PRIO         (0x3U<<22)
#define GPDMA_C3CR_PRIO_0       (0x1U<<22)
#define GPDMA_C3CR_LAP          (0x1U<<17)
#define GPDMA_C3CR_LSM          (0x1U<<16)
#define GPDMA_C3CR_SUSPIE       (0x1U<<13)
#define GPDMA_C3CR_USEIE        (0x1U<<12)
#define GPDMA_C3CR_ULEIE        (0x1U<<11)
#define GPDMA_C3CR_DTEIE        (0x1U<<10)
#define GPDMA_C3CR_HTIE         (0x1U<<9)
#define GPDMA_C3CR_TCIE         (0x1U<<8)
#define GPDMA_C3CR_SUSP         (0x1U<<2)
#define GPDMA_C3CR_RESET        (0x1U<<1)
#define GPDMA_C3CR_EN           (0x1U<<0)

// C3TR1 Configuration

#define GPDMA_C3TR1_DSEC        (0x1U<<31)
#define GPDMA_C3TR1_DAP         (0x1U<<30)
#define GPDMA_C3TR1_DHX         (0x1U<<27)
#define GPDMA_C3TR1_DBX         (0x1U<<26)
#define GPDMA_C3TR1_DBL_1       (0x3FU<<20)
#define GPDMA_C3TR1_DBL_1_0     (0x1U<<20)
#define GPDMA_C3TR1_DINC        (0x1U<<19)
#define GPDMA_C3TR1_DDW_LOG2    (0x3U<<16)
#define GPDMA_C3TR1_DDW_LOG2_0  (0x1U<<16)
#define GPDMA_C3TR1_SSEC        (0x1U<<15)
#define GPDMA_C3TR1_SAP         (0x1U<<14)
#define GPDMA_C3TR1_SBX         (0x1U<<13)
#define GPDMA_C3TR1_PAM         (0x3U<<11)
#define GPDMA_C3TR1_PAM_0       (0x1U<<11)
#define GPDMA_C3TR1_SBL_1       (0x3FU<<4)
#define GPDMA_C3TR1_SBL_1_0     (0x1U<<4)
#define GPDMA_C3TR1_SINC        (0x1U<<3)
#define GPDMA_C3TR1_SDW_LOG2    (0x3U<<0)
#define GPDMA_C3TR1_SDW_LOG2_0  (0x1U<<0)

// C3TR2 Configuration

#define GPDMA_C3TR2_TCEM        (0x3U<<30)
#define GPDMA_C3TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C3TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C3TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C3TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C3TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C3TR2_TRIGM       (0x3U<<14)
#define GPDMA_C3TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C3TR2_BREQ        (0x1U<<11)
#define GPDMA_C3TR2_DREQ        (0x1U<<10)
#define GPDMA_C3TR2_SWREQ       (0x1U<<9)
#define GPDMA_C3TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C3TR2_REQSEL_0    (0x1U<<0)

// C3BR1 Configuration

#define GPDMA_C3BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C3BR1_BNDT_0      (0x1U<<0)

// C3SAR Configuration

#define GPDMA_C3SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C3SAR_SA_0        (0x1U<<0)

// C3DAR Configuration

#define GPDMA_C3DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C3DAR_DA_0        (0x1U<<0)

// C3LLR Configuration

#define GPDMA_C3LLR_UT1         (0x1U<<31)
#define GPDMA_C3LLR_UT2         (0x1U<<30)
#define GPDMA_C3LLR_UB1         (0x1U<<29)
#define GPDMA_C3LLR_USA         (0x1U<<28)
#define GPDMA_C3LLR_UDA         (0x1U<<27)
#define GPDMA_C3LLR_ULL         (0x1U<<16)
#define GPDMA_C3LLR_LA          (0x3FFFU<<2)
#define GPDMA_C3LLR_LA_0        (0x1U<<2)

// C4LBAR Configuration

#define GPDMA_C4LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C4LBAR_LBA_0      (0x1U<<16)

// C4FCR Configuration

#define GPDMA_C4FCR_TOF         (0x1U<<14)
#define GPDMA_C4FCR_SUSPF       (0x1U<<13)
#define GPDMA_C4FCR_USEF        (0x1U<<12)
#define GPDMA_C4FCR_ULEF        (0x1U<<11)
#define GPDMA_C4FCR_DTEF        (0x1U<<10)
#define GPDMA_C4FCR_HTF         (0x1U<<9)
#define GPDMA_C4FCR_TCF         (0x1U<<8)

// C4SR Configuration

#define GPDMA_C4SR_FIFOL        (0xFFU<<16)
#define GPDMA_C4SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C4SR_SUSPF        (0x1U<<13)
#define GPDMA_C4SR_USEF         (0x1U<<12)
#define GPDMA_C4SR_ULEF         (0x1U<<11)
#define GPDMA_C4SR_DTEF         (0x1U<<10)
#define GPDMA_C4SR_HTF          (0x1U<<9)
#define GPDMA_C4SR_TCF          (0x1U<<8)
#define GPDMA_C4SR_IDLEF        (0x1U<<0)

// C4CR Configuration

#define GPDMA_C4CR_PRIO         (0x3U<<22)
#define GPDMA_C4CR_PRIO_0       (0x1U<<22)
#define GPDMA_C4CR_LAP          (0x1U<<17)
#define GPDMA_C4CR_LSM          (0x1U<<16)
#define GPDMA_C4CR_SUSPIE       (0x1U<<13)
#define GPDMA_C4CR_USEIE        (0x1U<<12)
#define GPDMA_C4CR_ULEIE        (0x1U<<11)
#define GPDMA_C4CR_DTEIE        (0x1U<<10)
#define GPDMA_C4CR_HTIE         (0x1U<<9)
#define GPDMA_C4CR_TCIE         (0x1U<<8)
#define GPDMA_C4CR_SUSP         (0x1U<<2)
#define GPDMA_C4CR_RESET        (0x1U<<1)
#define GPDMA_C4CR_EN           (0x1U<<0)

// C4TR2 Configuration

#define GPDMA_C4TR2_TCEM        (0x3U<<30)
#define GPDMA_C4TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C4TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C4TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C4TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C4TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C4TR2_TRIGM       (0x3U<<14)
#define GPDMA_C4TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C4TR2_BREQ        (0x1U<<11)
#define GPDMA_C4TR2_DREQ        (0x1U<<10)
#define GPDMA_C4TR2_SWREQ       (0x1U<<9)
#define GPDMA_C4TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C4TR2_REQSEL_0    (0x1U<<0)

// C4BR1 Configuration

#define GPDMA_C4BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C4BR1_BNDT_0      (0x1U<<0)

