Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
// C4SAR Configuration

#define GPDMA_C4SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C4SAR_SA_0        (0x1U<<0)

// C4DAR Configuration

#define GPDMA_C4DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C4DAR_DA_0        (0x1U<<0)

// C4LLR Configuration

#define GPDMA_C4LLR_UT1         (0x1U<<31)
#define GPDMA_C4LLR_UT2         (0x1U<<30)
#define GPDMA_C4LLR_UB1         (0x1U<<29)
#define GPDMA_C4LLR_USA         (0x1U<<28)
#define GPDMA_C4LLR_UDA         (0x1U<<27)
#define GPDMA_C4LLR_ULL         (0x1U<<16)
#define GPDMA_C4LLR_LA          (0x3FFFU<<2)
#define GPDMA_C4LLR_LA_0        (0x1U<<2)

// C5LBAR Configuration

#define GPDMA_C5LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C5LBAR_LBA_0      (0x1U<<16)

// C5FCR Configuration

#define GPDMA_C5FCR_TOF         (0x1U<<14)
#define GPDMA_C5FCR_SUSPF       (0x1U<<13)
#define GPDMA_C5FCR_USEF        (0x1U<<12)
#define GPDMA_C5FCR_ULEF        (0x1U<<11)
#define GPDMA_C5FCR_DTEF        (0x1U<<10)
#define GPDMA_C5FCR_HTF         (0x1U<<9)
#define GPDMA_C5FCR_TCF         (0x1U<<8)

// C5SR Configuration

#define GPDMA_C5SR_FIFOL        (0xFFU<<16)
#define GPDMA_C5SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C5SR_SUSPF        (0x1U<<13)
#define GPDMA_C5SR_USEF         (0x1U<<12)
#define GPDMA_C5SR_ULEF         (0x1U<<11)
#define GPDMA_C5SR_DTEF         (0x1U<<10)
#define GPDMA_C5SR_HTF          (0x1U<<9)
#define GPDMA_C5SR_TCF          (0x1U<<8)
#define GPDMA_C5SR_IDLEF        (0x1U<<0)

// C5CR Configuration

#define GPDMA_C5CR_PRIO         (0x3U<<22)
#define GPDMA_C5CR_PRIO_0       (0x1U<<22)
#define GPDMA_C5CR_LAP          (0x1U<<17)
#define GPDMA_C5CR_LSM          (0x1U<<16)
#define GPDMA_C5CR_SUSPIE       (0x1U<<13)
#define GPDMA_C5CR_USEIE        (0x1U<<12)
#define GPDMA_C5CR_ULEIE        (0x1U<<11)
#define GPDMA_C5CR_DTEIE        (0x1U<<10)
#define GPDMA_C5CR_HTIE         (0x1U<<9)
#define GPDMA_C5CR_TCIE         (0x1U<<8)
#define GPDMA_C5CR_SUSP         (0x1U<<2)
#define GPDMA_C5CR_RESET        (0x1U<<1)
#define GPDMA_C5CR_EN           (0x1U<<0)

// C5TR2 Configuration

#define GPDMA_C5TR2_TCEM        (0x3U<<30)
#define GPDMA_C5TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C5TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C5TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C5TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C5TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C5TR2_TRIGM       (0x3U<<14)
#define GPDMA_C5TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C5TR2_BREQ        (0x1U<<11)
#define GPDMA_C5TR2_DREQ        (0x1U<<10)
#define GPDMA_C5TR2_SWREQ       (0x1U<<9)
#define GPDMA_C5TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C5TR2_REQSEL_0    (0x1U<<0)

// C5BR1 Configuration

#define GPDMA_C5BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C5BR1_BNDT_0      (0x1U<<0)

// C5SAR Configuration

#define GPDMA_C5SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C5SAR_SA_0        (0x1U<<0)

// C5DAR Configuration

#define GPDMA_C5DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C5DAR_DA_0        (0x1U<<0)

// C5LLR Configuration

#define GPDMA_C5LLR_UT1         (0x1U<<31)
#define GPDMA_C5LLR_UT2         (0x1U<<30)
#define GPDMA_C5LLR_UB1         (0x1U<<29)
#define GPDMA_C5LLR_USA         (0x1U<<28)
#define GPDMA_C5LLR_UDA         (0x1U<<27)
#define GPDMA_C5LLR_ULL         (0x1U<<16)
#define GPDMA_C5LLR_LA          (0x3FFFU<<2)
#define GPDMA_C5LLR_LA_0        (0x1U<<2)

// C6LBAR Configuration

#define GPDMA_C6LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C6LBAR_LBA_0      (0x1U<<16)

// C6FCR Configuration

#define GPDMA_C6FCR_TOF         (0x1U<<14)
#define GPDMA_C6FCR_SUSPF       (0x1U<<13)
#define GPDMA_C6FCR_USEF        (0x1U<<12)
#define GPDMA_C6FCR_ULEF        (0x1U<<11)
#define GPDMA_C6FCR_DTEF        (0x1U<<10)
#define GPDMA_C6FCR_HTF         (0x1U<<9)
#define GPDMA_C6FCR_TCF         (0x1U<<8)

// C6SR Configuration

#define GPDMA_C6SR_FIFOL        (0xFFU<<16)
#define GPDMA_C6SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C6SR_SUSPF        (0x1U<<13)
#define GPDMA_C6SR_USEF         (0x1U<<12)
#define GPDMA_C6SR_ULEF         (0x1U<<11)
#define GPDMA_C6SR_DTEF         (0x1U<<10)
#define GPDMA_C6SR_HTF          (0x1U<<9)
#define GPDMA_C6SR_TCF          (0x1U<<8)
#define GPDMA_C6SR_IDLEF        (0x1U<<0)

// C6CR Configuration

#define GPDMA_C6CR_PRIO         (0x3U<<22)
#define GPDMA_C6CR_PRIO_0       (0x1U<<22)
#define GPDMA_C6CR_LAP          (0x1U<<17)
#define GPDMA_C6CR_LSM          (0x1U<<16)
#define GPDMA_C6CR_SUSPIE       (0x1U<<13)
#define GPDMA_C6CR_USEIE        (0x1U<<12)
#define GPDMA_C6CR_ULEIE        (0x1U<<11)
#define GPDMA_C6CR_DTEIE        (0x1U<<10)
#define GPDMA_C6CR_HTIE         (0x1U<<9)
#define GPDMA_C6CR_TCIE         (0x1U<<8)
#define GPDMA_C6CR_SUSP         (0x1U<<2)
#define GPDMA_C6CR_RESET        (0x1U<<1)
#define GPDMA_C6CR_EN           (0x1U<<0)

// C6TR2 Configuration

#define GPDMA_C6TR2_TCEM        (0x3U<<30)
#define GPDMA_C6TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C6TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C6TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C6TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C6TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C6TR2_TRIGM       (0x3U<<14)
#define GPDMA_C6TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C6TR2_BREQ        (0x1U<<11)
#define GPDMA_C6TR2_DREQ        (0x1U<<10)
#define GPDMA_C6TR2_SWREQ       (0x1U<<9)
#define GPDMA_C6TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C6TR2_REQSEL_0    (0x1U<<0)

// C6BR1 Configuration

#define GPDMA_C6BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C6BR1_BNDT_0      (0x1U<<0)

// C6SAR Configuration

#define GPDMA_C6SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C6SAR_SA_0        (0x1U<<0)

// C6DAR Configuration

#define GPDMA_C6DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C6DAR_DA_0        (0x1U<<0)

// C6LLR Configuration

#define GPDMA_C6LLR_UT1         (0x1U<<31)
#define GPDMA_C6LLR_UT2         (0x1U<<30)
#define GPDMA_C6LLR_UB1         (0x1U<<29)
#define GPDMA_C6LLR_USA         (0x1U<<28)
#define GPDMA_C6LLR_UDA         (0x1U<<27)
#define GPDMA_C6LLR_ULL         (0x1U<<16)
#define GPDMA_C6LLR_LA          (0x3FFFU<<2)
#define GPDMA_C6LLR_LA_0        (0x1U<<2)

// C7LBAR Configuration

