Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
#define GPDMA_C7LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C7LBAR_LBA_0      (0x1U<<16)

// C7FCR Configuration

#define GPDMA_C7FCR_TOF         (0x1U<<14)
#define GPDMA_C7FCR_SUSPF       (0x1U<<13)
#define GPDMA_C7FCR_USEF        (0x1U<<12)
#define GPDMA_C7FCR_ULEF        (0x1U<<11)
#define GPDMA_C7FCR_DTEF        (0x1U<<10)
#define GPDMA_C7FCR_HTF         (0x1U<<9)
#define GPDMA_C7FCR_TCF         (0x1U<<8)

// C7SR Configuration

#define GPDMA_C7SR_FIFOL        (0xFFU<<16)
#define GPDMA_C7SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C7SR_SUSPF        (0x1U<<13)
#define GPDMA_C7SR_USEF         (0x1U<<12)
#define GPDMA_C7SR_ULEF         (0x1U<<11)
#define GPDMA_C7SR_DTEF         (0x1U<<10)
#define GPDMA_C7SR_HTF          (0x1U<<9)
#define GPDMA_C7SR_TCF          (0x1U<<8)
#define GPDMA_C7SR_IDLEF        (0x1U<<0)

// C7CR Configuration

#define GPDMA_C7CR_PRIO         (0x3U<<22)
#define GPDMA_C7CR_PRIO_0       (0x1U<<22)
#define GPDMA_C7CR_LAP          (0x1U<<17)
#define GPDMA_C7CR_LSM          (0x1U<<16)
#define GPDMA_C7CR_SUSPIE       (0x1U<<13)
#define GPDMA_C7CR_USEIE        (0x1U<<12)
#define GPDMA_C7CR_ULEIE        (0x1U<<11)
#define GPDMA_C7CR_DTEIE        (0x1U<<10)
#define GPDMA_C7CR_HTIE         (0x1U<<9)
#define GPDMA_C7CR_TCIE         (0x1U<<8)
#define GPDMA_C7CR_SUSP         (0x1U<<2)
#define GPDMA_C7CR_RESET        (0x1U<<1)
#define GPDMA_C7CR_EN           (0x1U<<0)

// C7TR2 Configuration

#define GPDMA_C7TR2_TCEM        (0x3U<<30)
#define GPDMA_C7TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C7TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C7TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C7TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C7TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C7TR2_TRIGM       (0x3U<<14)
#define GPDMA_C7TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C7TR2_BREQ        (0x1U<<11)
#define GPDMA_C7TR2_DREQ        (0x1U<<10)
#define GPDMA_C7TR2_SWREQ       (0x1U<<9)
#define GPDMA_C7TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C7TR2_REQSEL_0    (0x1U<<0)

// C7BR1 Configuration

#define GPDMA_C7BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C7BR1_BNDT_0      (0x1U<<0)

// C7SAR Configuration

#define GPDMA_C7SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C7SAR_SA_0        (0x1U<<0)

// C7DAR Configuration

#define GPDMA_C7DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C7DAR_DA_0        (0x1U<<0)

// C7LLR Configuration

#define GPDMA_C7LLR_UT1         (0x1U<<31)
#define GPDMA_C7LLR_UT2         (0x1U<<30)
#define GPDMA_C7LLR_UB1         (0x1U<<29)
#define GPDMA_C7LLR_USA         (0x1U<<28)
#define GPDMA_C7LLR_UDA         (0x1U<<27)
#define GPDMA_C7LLR_ULL         (0x1U<<16)
#define GPDMA_C7LLR_LA          (0x3FFFU<<2)
#define GPDMA_C7LLR_LA_0        (0x1U<<2)

// C8LBAR Configuration

#define GPDMA_C8LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C8LBAR_LBA_0      (0x1U<<16)

// C8FCR Configuration

#define GPDMA_C8FCR_TOF         (0x1U<<14)
#define GPDMA_C8FCR_SUSPF       (0x1U<<13)
#define GPDMA_C8FCR_USEF        (0x1U<<12)
#define GPDMA_C8FCR_ULEF        (0x1U<<11)
#define GPDMA_C8FCR_DTEF        (0x1U<<10)
#define GPDMA_C8FCR_HTF         (0x1U<<9)
#define GPDMA_C8FCR_TCF         (0x1U<<8)

// C8SR Configuration

#define GPDMA_C8SR_FIFOL        (0xFFU<<16)
#define GPDMA_C8SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C8SR_SUSPF        (0x1U<<13)
#define GPDMA_C8SR_USEF         (0x1U<<12)
#define GPDMA_C8SR_ULEF         (0x1U<<11)
#define GPDMA_C8SR_DTEF         (0x1U<<10)
#define GPDMA_C8SR_HTF          (0x1U<<9)
#define GPDMA_C8SR_TCF          (0x1U<<8)
#define GPDMA_C8SR_IDLEF        (0x1U<<0)

// C8CR Configuration

#define GPDMA_C8CR_PRIO         (0x3U<<22)
#define GPDMA_C8CR_PRIO_0       (0x1U<<22)
#define GPDMA_C8CR_LAP          (0x1U<<17)
#define GPDMA_C8CR_LSM          (0x1U<<16)
#define GPDMA_C8CR_SUSPIE       (0x1U<<13)
#define GPDMA_C8CR_USEIE        (0x1U<<12)
#define GPDMA_C8CR_ULEIE        (0x1U<<11)
#define GPDMA_C8CR_DTEIE        (0x1U<<10)
#define GPDMA_C8CR_HTIE         (0x1U<<9)
#define GPDMA_C8CR_TCIE         (0x1U<<8)
#define GPDMA_C8CR_SUSP         (0x1U<<2)
#define GPDMA_C8CR_RESET        (0x1U<<1)
#define GPDMA_C8CR_EN           (0x1U<<0)

// C8TR2 Configuration

#define GPDMA_C8TR2_TCEM        (0x3U<<30)
#define GPDMA_C8TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C8TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C8TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C8TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C8TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C8TR2_TRIGM       (0x3U<<14)
#define GPDMA_C8TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C8TR2_BREQ        (0x1U<<11)
#define GPDMA_C8TR2_DREQ        (0x1U<<10)
#define GPDMA_C8TR2_SWREQ       (0x1U<<9)
#define GPDMA_C8TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C8TR2_REQSEL_0    (0x1U<<0)

// C8BR1 Configuration

#define GPDMA_C8BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C8BR1_BNDT_0      (0x1U<<0)

// C8SAR Configuration

#define GPDMA_C8SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C8SAR_SA_0        (0x1U<<0)

// C8DAR Configuration

#define GPDMA_C8DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C8DAR_DA_0        (0x1U<<0)

// C8LLR Configuration

#define GPDMA_C8LLR_UT1         (0x1U<<31)
#define GPDMA_C8LLR_UT2         (0x1U<<30)
#define GPDMA_C8LLR_UB1         (0x1U<<29)
#define GPDMA_C8LLR_USA         (0x1U<<28)
#define GPDMA_C8LLR_UDA         (0x1U<<27)
#define GPDMA_C8LLR_ULL         (0x1U<<16)
#define GPDMA_C8LLR_LA          (0x3FFFU<<2)
#define GPDMA_C8LLR_LA_0        (0x1U<<2)

// C9LBAR Configuration

#define GPDMA_C9LBAR_LBA        (0xFFFFU<<16)
#define GPDMA_C9LBAR_LBA_0      (0x1U<<16)

// C9FCR Configuration

#define GPDMA_C9FCR_TOF         (0x1U<<14)
#define GPDMA_C9FCR_SUSPF       (0x1U<<13)
#define GPDMA_C9FCR_USEF        (0x1U<<12)
#define GPDMA_C9FCR_ULEF        (0x1U<<11)
#define GPDMA_C9FCR_DTEF        (0x1U<<10)
#define GPDMA_C9FCR_HTF         (0x1U<<9)
#define GPDMA_C9FCR_TCF         (0x1U<<8)

// C9SR Configuration

#define GPDMA_C9SR_FIFOL        (0xFFU<<16)
#define GPDMA_C9SR_FIFOL_0      (0x1U<<16)
#define GPDMA_C9SR_SUSPF        (0x1U<<13)
#define GPDMA_C9SR_USEF         (0x1U<<12)
#define GPDMA_C9SR_ULEF         (0x1U<<11)
#define GPDMA_C9SR_DTEF         (0x1U<<10)
#define GPDMA_C9SR_HTF          (0x1U<<9)
#define GPDMA_C9SR_TCF          (0x1U<<8)
#define GPDMA_C9SR_IDLEF        (0x1U<<0)

