Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
// C9CR Configuration

#define GPDMA_C9CR_PRIO         (0x3U<<22)
#define GPDMA_C9CR_PRIO_0       (0x1U<<22)
#define GPDMA_C9CR_LAP          (0x1U<<17)
#define GPDMA_C9CR_LSM          (0x1U<<16)
#define GPDMA_C9CR_SUSPIE       (0x1U<<13)
#define GPDMA_C9CR_USEIE        (0x1U<<12)
#define GPDMA_C9CR_ULEIE        (0x1U<<11)
#define GPDMA_C9CR_DTEIE        (0x1U<<10)
#define GPDMA_C9CR_HTIE         (0x1U<<9)
#define GPDMA_C9CR_TCIE         (0x1U<<8)
#define GPDMA_C9CR_SUSP         (0x1U<<2)
#define GPDMA_C9CR_RESET        (0x1U<<1)
#define GPDMA_C9CR_EN           (0x1U<<0)

// C9TR2 Configuration

#define GPDMA_C9TR2_TCEM        (0x3U<<30)
#define GPDMA_C9TR2_TCEM_0      (0x1U<<30)
#define GPDMA_C9TR2_TRIGPOL     (0x3U<<24)
#define GPDMA_C9TR2_TRIGPOL_0   (0x1U<<24)
#define GPDMA_C9TR2_TRIGSEL     (0x3FU<<16)
#define GPDMA_C9TR2_TRIGSEL_0   (0x1U<<16)
#define GPDMA_C9TR2_TRIGM       (0x3U<<14)
#define GPDMA_C9TR2_TRIGM_0     (0x1U<<14)
#define GPDMA_C9TR2_BREQ        (0x1U<<11)
#define GPDMA_C9TR2_DREQ        (0x1U<<10)
#define GPDMA_C9TR2_SWREQ       (0x1U<<9)
#define GPDMA_C9TR2_REQSEL      (0x7FU<<0)
#define GPDMA_C9TR2_REQSEL_0    (0x1U<<0)

// C9BR1 Configuration

#define GPDMA_C9BR1_BNDT        (0xFFFFU<<0)
#define GPDMA_C9BR1_BNDT_0      (0x1U<<0)

// C9SAR Configuration

#define GPDMA_C9SAR_SA          (0xFFFFFFFFU<<0)
#define GPDMA_C9SAR_SA_0        (0x1U<<0)

// C9DAR Configuration

#define GPDMA_C9DAR_DA          (0xFFFFFFFFU<<0)
#define GPDMA_C9DAR_DA_0        (0x1U<<0)

// C9LLR Configuration

#define GPDMA_C9LLR_UT1         (0x1U<<31)
#define GPDMA_C9LLR_UT2         (0x1U<<30)
#define GPDMA_C9LLR_UB1         (0x1U<<29)
#define GPDMA_C9LLR_USA         (0x1U<<28)
#define GPDMA_C9LLR_UDA         (0x1U<<27)
#define GPDMA_C9LLR_ULL         (0x1U<<16)
#define GPDMA_C9LLR_LA          (0x3FFFU<<2)
#define GPDMA_C9LLR_LA_0        (0x1U<<2)

// C10LBAR Configuration

#define GPDMA_C10LBAR_LBA       (0xFFFFU<<16)
#define GPDMA_C10LBAR_LBA_0     (0x1U<<16)

// C10FCR Configuration

#define GPDMA_C10FCR_TOF        (0x1U<<14)
#define GPDMA_C10FCR_SUSPF      (0x1U<<13)
#define GPDMA_C10FCR_USEF       (0x1U<<12)
#define GPDMA_C10FCR_ULEF       (0x1U<<11)
#define GPDMA_C10FCR_DTEF       (0x1U<<10)
#define GPDMA_C10FCR_HTF        (0x1U<<9)
#define GPDMA_C10FCR_TCF        (0x1U<<8)

// C10SR Configuration

#define GPDMA_C10SR_FIFOL       (0xFFU<<16)
#define GPDMA_C10SR_FIFOL_0     (0x1U<<16)
#define GPDMA_C10SR_SUSPF       (0x1U<<13)
#define GPDMA_C10SR_USEF        (0x1U<<12)
#define GPDMA_C10SR_ULEF        (0x1U<<11)
#define GPDMA_C10SR_DTEF        (0x1U<<10)
#define GPDMA_C10SR_HTF         (0x1U<<9)
#define GPDMA_C10SR_TCF         (0x1U<<8)
#define GPDMA_C10SR_IDLEF       (0x1U<<0)

// C10CR Configuration

#define GPDMA_C10CR_PRIO        (0x3U<<22)
#define GPDMA_C10CR_PRIO_0      (0x1U<<22)
#define GPDMA_C10CR_LAP         (0x1U<<17)
#define GPDMA_C10CR_LSM         (0x1U<<16)
#define GPDMA_C10CR_SUSPIE      (0x1U<<13)
#define GPDMA_C10CR_USEIE       (0x1U<<12)
#define GPDMA_C10CR_ULEIE       (0x1U<<11)
#define GPDMA_C10CR_DTEIE       (0x1U<<10)
#define GPDMA_C10CR_HTIE        (0x1U<<9)
#define GPDMA_C10CR_TCIE        (0x1U<<8)
#define GPDMA_C10CR_SUSP        (0x1U<<2)
#define GPDMA_C10CR_RESET       (0x1U<<1)
#define GPDMA_C10CR_EN          (0x1U<<0)

// C10TR2 Configuration

#define GPDMA_C10TR2_TCEM       (0x3U<<30)
#define GPDMA_C10TR2_TCEM_0     (0x1U<<30)
#define GPDMA_C10TR2_TRIGPOL    (0x3U<<24)
#define GPDMA_C10TR2_TRIGPOL_0  (0x1U<<24)
#define GPDMA_C10TR2_TRIGSEL    (0x3FU<<16)
#define GPDMA_C10TR2_TRIGSEL_0  (0x1U<<16)
#define GPDMA_C10TR2_TRIGM      (0x3U<<14)
#define GPDMA_C10TR2_TRIGM_0    (0x1U<<14)
#define GPDMA_C10TR2_BREQ       (0x1U<<11)
#define GPDMA_C10TR2_DREQ       (0x1U<<10)
#define GPDMA_C10TR2_SWREQ      (0x1U<<9)
#define GPDMA_C10TR2_REQSEL     (0x7FU<<0)
#define GPDMA_C10TR2_REQSEL_0   (0x1U<<0)

// C10BR1 Configuration

#define GPDMA_C10BR1_BNDT       (0xFFFFU<<0)
#define GPDMA_C10BR1_BNDT_0     (0x1U<<0)

// C10SAR Configuration

#define GPDMA_C10SAR_SA         (0xFFFFFFFFU<<0)
#define GPDMA_C10SAR_SA_0       (0x1U<<0)

// C10DAR Configuration

#define GPDMA_C10DAR_DA         (0xFFFFFFFFU<<0)
#define GPDMA_C10DAR_DA_0       (0x1U<<0)

// C10LLR Configuration

#define GPDMA_C10LLR_UT1        (0x1U<<31)
#define GPDMA_C10LLR_UT2        (0x1U<<30)
#define GPDMA_C10LLR_UB1        (0x1U<<29)
#define GPDMA_C10LLR_USA        (0x1U<<28)
#define GPDMA_C10LLR_UDA        (0x1U<<27)
#define GPDMA_C10LLR_ULL        (0x1U<<16)
#define GPDMA_C10LLR_LA         (0x3FFFU<<2)
#define GPDMA_C10LLR_LA_0       (0x1U<<2)

// C11LBAR Configuration

#define GPDMA_C11LBAR_LBA       (0xFFFFU<<16)
#define GPDMA_C11LBAR_LBA_0     (0x1U<<16)

// C11FCR Configuration

#define GPDMA_C11FCR_TOF        (0x1U<<14)
#define GPDMA_C11FCR_SUSPF      (0x1U<<13)
#define GPDMA_C11FCR_USEF       (0x1U<<12)
#define GPDMA_C11FCR_ULEF       (0x1U<<11)
#define GPDMA_C11FCR_DTEF       (0x1U<<10)
#define GPDMA_C11FCR_HTF        (0x1U<<9)
#define GPDMA_C11FCR_TCF        (0x1U<<8)

// C11SR Configuration

#define GPDMA_C11SR_FIFOL       (0xFFU<<16)
#define GPDMA_C11SR_FIFOL_0     (0x1U<<16)
#define GPDMA_C11SR_SUSPF       (0x1U<<13)
#define GPDMA_C11SR_USEF        (0x1U<<12)
#define GPDMA_C11SR_ULEF        (0x1U<<11)
#define GPDMA_C11SR_DTEF        (0x1U<<10)
#define GPDMA_C11SR_HTF         (0x1U<<9)
#define GPDMA_C11SR_TCF         (0x1U<<8)
#define GPDMA_C11SR_IDLEF       (0x1U<<0)

// C11CR Configuration

#define GPDMA_C11CR_PRIO        (0x3U<<22)
#define GPDMA_C11CR_PRIO_0      (0x1U<<22)
#define GPDMA_C11CR_LAP         (0x1U<<17)
#define GPDMA_C11CR_LSM         (0x1U<<16)
#define GPDMA_C11CR_SUSPIE      (0x1U<<13)
#define GPDMA_C11CR_USEIE       (0x1U<<12)
#define GPDMA_C11CR_ULEIE       (0x1U<<11)
#define GPDMA_C11CR_DTEIE       (0x1U<<10)
#define GPDMA_C11CR_HTIE        (0x1U<<9)
#define GPDMA_C11CR_TCIE        (0x1U<<8)
#define GPDMA_C11CR_SUSP        (0x1U<<2)
#define GPDMA_C11CR_RESET       (0x1U<<1)
#define GPDMA_C11CR_EN          (0x1U<<0)

// C11TR2 Configuration

#define GPDMA_C11TR2_TCEM       (0x3U<<30)
#define GPDMA_C11TR2_TCEM_0     (0x1U<<30)
#define GPDMA_C11TR2_TRIGPOL    (0x3U<<24)
#define GPDMA_C11TR2_TRIGPOL_0  (0x1U<<24)
#define GPDMA_C11TR2_TRIGSEL    (0x3FU<<16)
#define GPDMA_C11TR2_TRIGSEL_0  (0x1U<<16)
#define GPDMA_C11TR2_TRIGM      (0x3U<<14)
#define GPDMA_C11TR2_TRIGM_0    (0x1U<<14)
#define GPDMA_C11TR2_BREQ       (0x1U<<11)
#define GPDMA_C11TR2_DREQ       (0x1U<<10)
#define GPDMA_C11TR2_SWREQ      (0x1U<<9)
#define GPDMA_C11TR2_REQSEL     (0x7FU<<0)
#define GPDMA_C11TR2_REQSEL_0   (0x1U<<0)

// C11BR1 Configuration

#define GPDMA_C11BR1_BNDT       (0xFFFFU<<0)
#define GPDMA_C11BR1_BNDT_0     (0x1U<<0)

// C11SAR Configuration

#define GPDMA_C11SAR_SA         (0xFFFFFFFFU<<0)
#define GPDMA_C11SAR_SA_0       (0x1U<<0)

// C11DAR Configuration

#define GPDMA_C11DAR_DA         (0xFFFFFFFFU<<0)
#define GPDMA_C11DAR_DA_0       (0x1U<<0)

