Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
// C11LLR Configuration

#define GPDMA_C11LLR_UT1        (0x1U<<31)
#define GPDMA_C11LLR_UT2        (0x1U<<30)
#define GPDMA_C11LLR_UB1        (0x1U<<29)
#define GPDMA_C11LLR_USA        (0x1U<<28)
#define GPDMA_C11LLR_UDA        (0x1U<<27)
#define GPDMA_C11LLR_ULL        (0x1U<<16)
#define GPDMA_C11LLR_LA         (0x3FFFU<<2)
#define GPDMA_C11LLR_LA_0       (0x1U<<2)

// C12LBAR Configuration

#define GPDMA_C12LBAR_LBA       (0xFFFFU<<16)
#define GPDMA_C12LBAR_LBA_0     (0x1U<<16)

// C12FCR Configuration

#define GPDMA_C12FCR_TOF        (0x1U<<14)
#define GPDMA_C12FCR_SUSPF      (0x1U<<13)
#define GPDMA_C12FCR_USEF       (0x1U<<12)
#define GPDMA_C12FCR_ULEF       (0x1U<<11)
#define GPDMA_C12FCR_DTEF       (0x1U<<10)
#define GPDMA_C12FCR_HTF        (0x1U<<9)
#define GPDMA_C12FCR_TCF        (0x1U<<8)

// C12SR Configuration

#define GPDMA_C12SR_FIFOL       (0xFFU<<16)
#define GPDMA_C12SR_FIFOL_0     (0x1U<<16)
#define GPDMA_C12SR_SUSPF       (0x1U<<13)
#define GPDMA_C12SR_USEF        (0x1U<<12)
#define GPDMA_C12SR_ULEF        (0x1U<<11)
#define GPDMA_C12SR_DTEF        (0x1U<<10)
#define GPDMA_C12SR_HTF         (0x1U<<9)
#define GPDMA_C12SR_TCF         (0x1U<<8)
#define GPDMA_C12SR_IDLEF       (0x1U<<0)

// C12CR Configuration

#define GPDMA_C12CR_PRIO        (0x3U<<22)
#define GPDMA_C12CR_PRIO_0      (0x1U<<22)
#define GPDMA_C12CR_LAP         (0x1U<<17)
#define GPDMA_C12CR_LSM         (0x1U<<16)
#define GPDMA_C12CR_SUSPIE      (0x1U<<13)
#define GPDMA_C12CR_USEIE       (0x1U<<12)
#define GPDMA_C12CR_ULEIE       (0x1U<<11)
#define GPDMA_C12CR_DTEIE       (0x1U<<10)
#define GPDMA_C12CR_HTIE        (0x1U<<9)
#define GPDMA_C12CR_TCIE        (0x1U<<8)
#define GPDMA_C12CR_SUSP        (0x1U<<2)
#define GPDMA_C12CR_RESET       (0x1U<<1)
#define GPDMA_C12CR_EN          (0x1U<<0)

// C12TR2 Configuration

#define GPDMA_C12TR2_TCEM       (0x3U<<30)
#define GPDMA_C12TR2_TCEM_0     (0x1U<<30)
#define GPDMA_C12TR2_TRIGPOL    (0x3U<<24)
#define GPDMA_C12TR2_TRIGPOL_0  (0x1U<<24)
#define GPDMA_C12TR2_TRIGSEL    (0x3FU<<16)
#define GPDMA_C12TR2_TRIGSEL_0  (0x1U<<16)
#define GPDMA_C12TR2_TRIGM      (0x3U<<14)
#define GPDMA_C12TR2_TRIGM_0    (0x1U<<14)
#define GPDMA_C12TR2_BREQ       (0x1U<<11)
#define GPDMA_C12TR2_DREQ       (0x1U<<10)
#define GPDMA_C12TR2_SWREQ      (0x1U<<9)
#define GPDMA_C12TR2_REQSEL     (0x7FU<<0)
#define GPDMA_C12TR2_REQSEL_0   (0x1U<<0)

// C12BR1 Configuration

#define GPDMA_C12BR1_BRDDEC     (0x1U<<31)
#define GPDMA_C12BR1_BRSDEC     (0x1U<<30)
#define GPDMA_C12BR1_DDEC       (0x1U<<29)
#define GPDMA_C12BR1_SDEC       (0x1U<<28)
#define GPDMA_C12BR1_BRC        (0x7FFU<<16)
#define GPDMA_C12BR1_BRC_0      (0x1U<<16)
#define GPDMA_C12BR1_BNDT       (0xFFFFU<<0)
#define GPDMA_C12BR1_BNDT_0     (0x1U<<0)

// C12SAR Configuration

#define GPDMA_C12SAR_SA         (0xFFFFFFFFU<<0)
#define GPDMA_C12SAR_SA_0       (0x1U<<0)

// C12DAR Configuration

#define GPDMA_C12DAR_DA         (0xFFFFFFFFU<<0)
#define GPDMA_C12DAR_DA_0       (0x1U<<0)

// C12TR3 Configuration

#define GPDMA_C12TR3_DAO        (0x1FFFU<<16)
#define GPDMA_C12TR3_DAO_0      (0x1U<<16)
#define GPDMA_C12TR3_SAO        (0x1FFFU<<0)
#define GPDMA_C12TR3_SAO_0      (0x1U<<0)

// C12BR2 Configuration

#define GPDMA_C12BR2_BRDAO      (0xFFFFU<<16)
#define GPDMA_C12BR2_BRDAO_0    (0x1U<<16)
#define GPDMA_C12BR2_BRSAO      (0xFFFFU<<0)
#define GPDMA_C12BR2_BRSAO_0    (0x1U<<0)

// C12LLR Configuration

#define GPDMA_C12LLR_UT1        (0x1U<<31)
#define GPDMA_C12LLR_UT2        (0x1U<<30)
#define GPDMA_C12LLR_UB1        (0x1U<<29)
#define GPDMA_C12LLR_USA        (0x1U<<28)
#define GPDMA_C12LLR_UDA        (0x1U<<27)
#define GPDMA_C12LLR_UT3        (0x1U<<26)
#define GPDMA_C12LLR_UB2        (0x1U<<25)
#define GPDMA_C12LLR_ULL        (0x1U<<16)
#define GPDMA_C12LLR_LA         (0x3FFFU<<2)
#define GPDMA_C12LLR_LA_0       (0x1U<<2)

// C13LBAR Configuration

#define GPDMA_C13LBAR_LBA       (0xFFFFU<<16)
#define GPDMA_C13LBAR_LBA_0     (0x1U<<16)

// C13FCR Configuration

#define GPDMA_C13FCR_TOF        (0x1U<<14)
#define GPDMA_C13FCR_SUSPF      (0x1U<<13)
#define GPDMA_C13FCR_USEF       (0x1U<<12)
#define GPDMA_C13FCR_ULEF       (0x1U<<11)
#define GPDMA_C13FCR_DTEF       (0x1U<<10)
#define GPDMA_C13FCR_HTF        (0x1U<<9)
#define GPDMA_C13FCR_TCF        (0x1U<<8)

// C13SR Configuration

#define GPDMA_C13SR_FIFOL       (0xFFU<<16)
#define GPDMA_C13SR_FIFOL_0     (0x1U<<16)
#define GPDMA_C13SR_SUSPF       (0x1U<<13)
#define GPDMA_C13SR_USEF        (0x1U<<12)
#define GPDMA_C13SR_ULEF        (0x1U<<11)
#define GPDMA_C13SR_DTEF        (0x1U<<10)
#define GPDMA_C13SR_HTF         (0x1U<<9)
#define GPDMA_C13SR_TCF         (0x1U<<8)
#define GPDMA_C13SR_IDLEF       (0x1U<<0)

// C13CR Configuration

#define GPDMA_C13CR_PRIO        (0x3U<<22)
#define GPDMA_C13CR_PRIO_0      (0x1U<<22)
#define GPDMA_C13CR_LAP         (0x1U<<17)
#define GPDMA_C13CR_LSM         (0x1U<<16)
#define GPDMA_C13CR_SUSPIE      (0x1U<<13)
#define GPDMA_C13CR_USEIE       (0x1U<<12)
#define GPDMA_C13CR_ULEIE       (0x1U<<11)
#define GPDMA_C13CR_DTEIE       (0x1U<<10)
#define GPDMA_C13CR_HTIE        (0x1U<<9)
#define GPDMA_C13CR_TCIE        (0x1U<<8)
#define GPDMA_C13CR_SUSP        (0x1U<<2)
#define GPDMA_C13CR_RESET       (0x1U<<1)
#define GPDMA_C13CR_EN          (0x1U<<0)

// C13TR2 Configuration

#define GPDMA_C13TR2_TCEM       (0x3U<<30)
#define GPDMA_C13TR2_TCEM_0     (0x1U<<30)
#define GPDMA_C13TR2_TRIGPOL    (0x3U<<24)
#define GPDMA_C13TR2_TRIGPOL_0  (0x1U<<24)
#define GPDMA_C13TR2_TRIGSEL    (0x3FU<<16)
#define GPDMA_C13TR2_TRIGSEL_0  (0x1U<<16)
#define GPDMA_C13TR2_TRIGM      (0x3U<<14)
#define GPDMA_C13TR2_TRIGM_0    (0x1U<<14)
#define GPDMA_C13TR2_BREQ       (0x1U<<11)
#define GPDMA_C13TR2_DREQ       (0x1U<<10)
#define GPDMA_C13TR2_SWREQ      (0x1U<<9)
#define GPDMA_C13TR2_REQSEL     (0x7FU<<0)
#define GPDMA_C13TR2_REQSEL_0   (0x1U<<0)

// C13BR1 Configuration

#define GPDMA_C13BR1_BRDDEC     (0x1U<<31)
#define GPDMA_C13BR1_BRSDEC     (0x1U<<30)
#define GPDMA_C13BR1_DDEC       (0x1U<<29)
#define GPDMA_C13BR1_SDEC       (0x1U<<28)
#define GPDMA_C13BR1_BRC        (0x7FFU<<16)
#define GPDMA_C13BR1_BRC_0      (0x1U<<16)
#define GPDMA_C13BR1_BNDT       (0xFFFFU<<0)
#define GPDMA_C13BR1_BNDT_0     (0x1U<<0)

// C13SAR Configuration

#define GPDMA_C13SAR_SA         (0xFFFFFFFFU<<0)
#define GPDMA_C13SAR_SA_0       (0x1U<<0)

