Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpdma.h
// C13DAR Configuration

#define GPDMA_C13DAR_DA         (0xFFFFFFFFU<<0)
#define GPDMA_C13DAR_DA_0       (0x1U<<0)

// C13TR3 Configuration

#define GPDMA_C13TR3_DAO        (0x1FFFU<<16)
#define GPDMA_C13TR3_DAO_0      (0x1U<<16)
#define GPDMA_C13TR3_SAO        (0x1FFFU<<0)
#define GPDMA_C13TR3_SAO_0      (0x1U<<0)

// C13BR2 Configuration

#define GPDMA_C13BR2_BRDAO      (0xFFFFU<<16)
#define GPDMA_C13BR2_BRDAO_0    (0x1U<<16)
#define GPDMA_C13BR2_BRSAO      (0xFFFFU<<0)
#define GPDMA_C13BR2_BRSAO_0    (0x1U<<0)

// C13LLR Configuration

#define GPDMA_C13LLR_UT1        (0x1U<<31)
#define GPDMA_C13LLR_UT2        (0x1U<<30)
#define GPDMA_C13LLR_UB1        (0x1U<<29)
#define GPDMA_C13LLR_USA        (0x1U<<28)
#define GPDMA_C13LLR_UDA        (0x1U<<27)
#define GPDMA_C13LLR_UT3        (0x1U<<26)
#define GPDMA_C13LLR_UB2        (0x1U<<25)
#define GPDMA_C13LLR_ULL        (0x1U<<16)
#define GPDMA_C13LLR_LA         (0x3FFFU<<2)
#define GPDMA_C13LLR_LA_0       (0x1U<<2)

// C14LBAR Configuration

#define GPDMA_C14LBAR_LBA       (0xFFFFU<<16)
#define GPDMA_C14LBAR_LBA_0     (0x1U<<16)

// C14FCR Configuration

#define GPDMA_C14FCR_TOF        (0x1U<<14)
#define GPDMA_C14FCR_SUSPF      (0x1U<<13)
#define GPDMA_C14FCR_USEF       (0x1U<<12)
#define GPDMA_C14FCR_ULEF       (0x1U<<11)
#define GPDMA_C14FCR_DTEF       (0x1U<<10)
#define GPDMA_C14FCR_HTF        (0x1U<<9)
#define GPDMA_C14FCR_TCF        (0x1U<<8)

// C14SR Configuration

#define GPDMA_C14SR_FIFOL       (0xFFU<<16)
#define GPDMA_C14SR_FIFOL_0     (0x1U<<16)
#define GPDMA_C14SR_SUSPF       (0x1U<<13)
#define GPDMA_C14SR_USEF        (0x1U<<12)
#define GPDMA_C14SR_ULEF        (0x1U<<11)
#define GPDMA_C14SR_DTEF        (0x1U<<10)
#define GPDMA_C14SR_HTF         (0x1U<<9)
#define GPDMA_C14SR_TCF         (0x1U<<8)
#define GPDMA_C14SR_IDLEF       (0x1U<<0)

// C14CR Configuration

#define GPDMA_C14CR_PRIO        (0x3U<<22)
#define GPDMA_C14CR_PRIO_0      (0x1U<<22)
#define GPDMA_C14CR_LAP         (0x1U<<17)
#define GPDMA_C14CR_LSM         (0x1U<<16)
#define GPDMA_C14CR_SUSPIE      (0x1U<<13)
#define GPDMA_C14CR_USEIE       (0x1U<<12)
#define GPDMA_C14CR_ULEIE       (0x1U<<11)
#define GPDMA_C14CR_DTEIE       (0x1U<<10)
#define GPDMA_C14CR_HTIE        (0x1U<<9)
#define GPDMA_C14CR_TCIE        (0x1U<<8)
#define GPDMA_C14CR_SUSP        (0x1U<<2)
#define GPDMA_C14CR_RESET       (0x1U<<1)
#define GPDMA_C14CR_EN          (0x1U<<0)

// C14TR2 Configuration

#define GPDMA_C14TR2_TCEM       (0x3U<<30)
#define GPDMA_C14TR2_TCEM_0     (0x1U<<30)
#define GPDMA_C14TR2_TRIGPOL    (0x3U<<24)
#define GPDMA_C14TR2_TRIGPOL_0  (0x1U<<24)
#define GPDMA_C14TR2_TRIGSEL    (0x3FU<<16)
#define GPDMA_C14TR2_TRIGSEL_0  (0x1U<<16)
#define GPDMA_C14TR2_TRIGM      (0x3U<<14)
#define GPDMA_C14TR2_TRIGM_0    (0x1U<<14)
#define GPDMA_C14TR2_BREQ       (0x1U<<11)
#define GPDMA_C14TR2_DREQ       (0x1U<<10)
#define GPDMA_C14TR2_SWREQ      (0x1U<<9)
#define GPDMA_C14TR2_REQSEL     (0x7FU<<0)
#define GPDMA_C14TR2_REQSEL_0   (0x1U<<0)

// C14BR1 Configuration

#define GPDMA_C14BR1_BRDDEC     (0x1U<<31)
#define GPDMA_C14BR1_BRSDEC     (0x1U<<30)
#define GPDMA_C14BR1_DDEC       (0x1U<<29)
#define GPDMA_C14BR1_SDEC       (0x1U<<28)
#define GPDMA_C14BR1_BRC        (0x7FFU<<16)
#define GPDMA_C14BR1_BRC_0      (0x1U<<16)
#define GPDMA_C14BR1_BNDT       (0xFFFFU<<0)
#define GPDMA_C14BR1_BNDT_0     (0x1U<<0)

// C14SAR Configuration

#define GPDMA_C14SAR_SA         (0xFFFFFFFFU<<0)
#define GPDMA_C14SAR_SA_0       (0x1U<<0)

// C14DAR Configuration

#define GPDMA_C14DAR_DA         (0xFFFFFFFFU<<0)
#define GPDMA_C14DAR_DA_0       (0x1U<<0)

// C14TR3 Configuration

#define GPDMA_C14TR3_DAO        (0x1FFFU<<16)
#define GPDMA_C14TR3_DAO_0      (0x1U<<16)
#define GPDMA_C14TR3_SAO        (0x1FFFU<<0)
#define GPDMA_C14TR3_SAO_0      (0x1U<<0)

// C14BR2 Configuration

#define GPDMA_C14BR2_BRDAO      (0xFFFFU<<16)
#define GPDMA_C14BR2_BRDAO_0    (0x1U<<16)
#define GPDMA_C14BR2_BRSAO      (0xFFFFU<<0)
#define GPDMA_C14BR2_BRSAO_0    (0x1U<<0)

// C14LLR Configuration

#define GPDMA_C14LLR_UT1        (0x1U<<31)
#define GPDMA_C14LLR_UT2        (0x1U<<30)
#define GPDMA_C14LLR_UB1        (0x1U<<29)
#define GPDMA_C14LLR_USA        (0x1U<<28)
#define GPDMA_C14LLR_UDA        (0x1U<<27)
#define GPDMA_C14LLR_UT3        (0x1U<<26)
#define GPDMA_C14LLR_UB2        (0x1U<<25)
#define GPDMA_C14LLR_ULL        (0x1U<<16)
#define GPDMA_C14LLR_LA         (0x3FFFU<<2)
#define GPDMA_C14LLR_LA_0       (0x1U<<2)

// C15LBAR Configuration

#define GPDMA_C15LBAR_LBA       (0xFFFFU<<16)
#define GPDMA_C15LBAR_LBA_0     (0x1U<<16)

// C15FCR Configuration

#define GPDMA_C15FCR_TOF        (0x1U<<14)
#define GPDMA_C15FCR_SUSPF      (0x1U<<13)
#define GPDMA_C15FCR_USEF       (0x1U<<12)
#define GPDMA_C15FCR_ULEF       (0x1U<<11)
#define GPDMA_C15FCR_DTEF       (0x1U<<10)
#define GPDMA_C15FCR_HTF        (0x1U<<9)
#define GPDMA_C15FCR_TCF        (0x1U<<8)

// C15SR Configuration

#define GPDMA_C15SR_FIFOL       (0xFFU<<16)
#define GPDMA_C15SR_FIFOL_0     (0x1U<<16)
#define GPDMA_C15SR_SUSPF       (0x1U<<13)
#define GPDMA_C15SR_USEF        (0x1U<<12)
#define GPDMA_C15SR_ULEF        (0x1U<<11)
#define GPDMA_C15SR_DTEF        (0x1U<<10)
#define GPDMA_C15SR_HTF         (0x1U<<9)
#define GPDMA_C15SR_TCF         (0x1U<<8)
#define GPDMA_C15SR_IDLEF       (0x1U<<0)

// C15CR Configuration

#define GPDMA_C15CR_PRIO        (0x3U<<22)
#define GPDMA_C15CR_PRIO_0      (0x1U<<22)
#define GPDMA_C15CR_LAP         (0x1U<<17)
#define GPDMA_C15CR_LSM         (0x1U<<16)
#define GPDMA_C15CR_SUSPIE      (0x1U<<13)
#define GPDMA_C15CR_USEIE       (0x1U<<12)
#define GPDMA_C15CR_ULEIE       (0x1U<<11)
#define GPDMA_C15CR_DTEIE       (0x1U<<10)
#define GPDMA_C15CR_HTIE        (0x1U<<9)
#define GPDMA_C15CR_TCIE        (0x1U<<8)
#define GPDMA_C15CR_SUSP        (0x1U<<2)
#define GPDMA_C15CR_RESET       (0x1U<<1)
#define GPDMA_C15CR_EN          (0x1U<<0)

// C15TR2 Configuration

#define GPDMA_C15TR2_TCEM       (0x3U<<30)
#define GPDMA_C15TR2_TCEM_0     (0x1U<<30)
#define GPDMA_C15TR2_TRIGPOL    (0x3U<<24)
#define GPDMA_C15TR2_TRIGPOL_0  (0x1U<<24)
#define GPDMA_C15TR2_TRIGSEL    (0x3FU<<16)
#define GPDMA_C15TR2_TRIGSEL_0  (0x1U<<16)
#define GPDMA_C15TR2_TRIGM      (0x3U<<14)
#define GPDMA_C15TR2_TRIGM_0    (0x1U<<14)
#define GPDMA_C15TR2_BREQ       (0x1U<<11)
#define GPDMA_C15TR2_DREQ       (0x1U<<10)
#define GPDMA_C15TR2_SWREQ      (0x1U<<9)
#define GPDMA_C15TR2_REQSEL     (0x7FU<<0)
#define GPDMA_C15TR2_REQSEL_0   (0x1U<<0)

// C15BR1 Configuration

#define GPDMA_C15BR1_BRDDEC     (0x1U<<31)
#define GPDMA_C15BR1_BRSDEC     (0x1U<<30)
#define GPDMA_C15BR1_DDEC       (0x1U<<29)
#define GPDMA_C15BR1_SDEC       (0x1U<<28)
#define GPDMA_C15BR1_BRC        (0x7FFU<<16)
#define GPDMA_C15BR1_BRC_0      (0x1U<<16)
#define GPDMA_C15BR1_BNDT       (0xFFFFU<<0)
#define GPDMA_C15BR1_BNDT_0     (0x1U<<0)

// C15SAR Configuration

#define GPDMA_C15SAR_SA         (0xFFFFFFFFU<<0)
#define GPDMA_C15SAR_SA_0       (0x1U<<0)

// C15DAR Configuration

#define GPDMA_C15DAR_DA         (0xFFFFFFFFU<<0)
#define GPDMA_C15DAR_DA_0       (0x1U<<0)

// C15TR3 Configuration

#define GPDMA_C15TR3_DAO        (0x1FFFU<<16)
#define GPDMA_C15TR3_DAO_0      (0x1U<<16)
#define GPDMA_C15TR3_SAO        (0x1FFFU<<0)
#define GPDMA_C15TR3_SAO_0      (0x1U<<0)

// C15BR2 Configuration

#define GPDMA_C15BR2_BRDAO      (0xFFFFU<<16)
#define GPDMA_C15BR2_BRDAO_0    (0x1U<<16)
#define GPDMA_C15BR2_BRSAO      (0xFFFFU<<0)
#define GPDMA_C15BR2_BRSAO_0    (0x1U<<0)

// C15LLR Configuration

#define GPDMA_C15LLR_UT1        (0x1U<<31)
#define GPDMA_C15LLR_UT2        (0x1U<<30)
#define GPDMA_C15LLR_UB1        (0x1U<<29)
#define GPDMA_C15LLR_USA        (0x1U<<28)
#define GPDMA_C15LLR_UDA        (0x1U<<27)
#define GPDMA_C15LLR_UT3        (0x1U<<26)
#define GPDMA_C15LLR_UB2        (0x1U<<25)
#define GPDMA_C15LLR_ULL        (0x1U<<16)
#define GPDMA_C15LLR_LA         (0x3FFFU<<2)
#define GPDMA_C15LLR_LA_0       (0x1U<<2)
